Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.ActiveFilePath Property
 Gets the path to the local copy of the current revision of the reference model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ActiveFilePath { get; }
Public ReadOnly Property ActiveFilePath As String
	Get
Property Value
Type: String
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace